app/controllers/contents_controller.rb

SELECT "contents".* FROM "contents"
---
  def index
    @contents = Content.all

INSERT INTO "contents" ("created_at", "text", "updated_at") VALUES (?, ?, ?)
---
  def create
    @content = Content.new(content_params)

    respond_to do |format|
      if @content.save

UPDATE "contents" SET "text" = ?, "updated_at" = ? WHERE "contents"."id" = 1
---
  def update
    respond_to do |format|
      if @content.update(content_params)

SELECT "contents".* FROM "contents" WHERE "contents"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_content
      @content = Content.find(params[:id])