app/controllers/index_controller.rb

  def index
    @skills = Skill.all
    @contents = Content.all
    @socials = Social.all
---
SELECT "skills".* FROM "skills"
SELECT "contents".* FROM "contents"
SELECT "socials".* FROM "socials"