app/controllers/skills_controller.rb

SELECT "skills".* FROM "skills"
---
  def index
    @skills = Skill.all

INSERT INTO "skills" ("created_at", "description", "level", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 09 Mar 2014 05:08:57 UTC +00:00], ["description", "asdasd"], ["level", 2], ["name", "asdasd"], ["updated_at", Sun, 09 Mar 2014 05:08:57 UTC +00:00]]
---
  def create
    @skill = Skill.new(skill_params)

    respond_to do |format|
      if @skill.save

SELECT "skills".* FROM "skills" WHERE "skills"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_skill
      @skill = Skill.find(params[:id])