app/controllers/socials_controller.rb

SELECT "socials".* FROM "socials"
---
  def index
    @socials = Social.all

INSERT INTO "socials" ("color", "created_at", "link", "name", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @social = Social.new(social_params)

    respond_to do |format|
      if @social.save

SELECT "socials".* FROM "socials" WHERE "socials"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_social
      @social = Social.find(params[:id])